node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "global_step"
    }
  }
}
node {
  name: "global_step/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "global_step"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/Assign"
  op: "AssignVariableOp"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "global_step"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "global_step"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond"
  op: "If"
  input: "global_step/VarIsInitializedOp"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "Tcond"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "Tin"
    value {
      list {
        type: DT_RESOURCE
        type: DT_INT64
      }
    }
  }
  attr {
    key: "Tout"
    value {
      list {
        type: DT_INT64
      }
    }
  }
  attr {
    key: "_lower_using_switch_merge"
    value {
      b: true
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "_read_only_resource_inputs"
    value {
      list {
        i: 1
      }
    }
  }
  attr {
    key: "else_branch"
    value {
      func {
        name: "global_step_cond_false_42"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "then_branch"
    value {
      func {
        name: "global_step_cond_true_41"
      }
    }
  }
}
node {
  name: "global_step/cond/Identity"
  op: "Identity"
  input: "global_step/cond"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "AddV2"
  input: "global_step/cond/Identity"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "normalize_element/component_0"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 79
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 79
          }
        }
        tensor_content: ";F\277\242|\311\343\277 \205\215\206\253\324\363?\304\r\214\334!\230\364\277\272\274\267\222@\255\357\277\016H\250\030#\326\000\300\004I\210\324\003\212\372\277\375\373YE\221\317\362\277\321@\216[\360r\343?\256e\246\024\024\317\003\300\250-\036\037\366\017\336\277\235\031XA\202\310\365\277S\215\207\377\276\353\352\277f\363\213\375[\241\330?\334TT9d\272\373\277;F\277\242|\311\343\277\215\024\321\277\312n\230\277#\361\2309\247\324\251?\237\373\205vo\270\377?\332\316\275\370\362\214\324\277f\363\213\375[\241\330?\200g\217\212\272\333\360?\370\025\206U5\257\333\277\265\260\212\021^R\301\277\361>\033\313\342\226\317\277\272\274\267\222@\255\357\277\313G\251\254k=\257\277\301\223\"\035\223\305\353?2p\276\356q4\350?om\365\274\352s\361?H\254\303\240\031\177\321?\016H\250\030#\326\000\300\370\025\206U5\257\333\277P\267\206K\264V\357?<7V=s\301\370\277 \205\215\206\253\324\363?\005\304[j\332\337\323?\200g\217\212\272\333\360?\313G\251\254k=\257\277\016H\250\030#\326\000\300{\201\273\232^\273\351\277\321@\216[\360r\343?<7V=s\301\370\277c:\363=\034\231\342\277f\363\213\375[\241\330?\220\017\3537a\325\312\277;F\277\242|\311\343\277\370\025\206U5\257\333\277\301\223\"\035\223\305\353?\250-\036\037\366\017\336\277om\365\274\352s\361?;F\277\242|\311\343\277\354]Wl=*\346\277\0266\215\351Y\360\277?<7V=s\301\370\277\235\031XA\202\310\365\277\361>\033\313\342\226\317\277~t\245\222\214K\005\300;F\277\242|\311\343\277\250\002\265\374\270!\271\277)=\274o\243Y\371\277\272\274\267\222@\255\357\277vhoF\233\217\n@\332\316\275\370\362\214\324\277\313G\251\254k=\257\277\0266\215\351Y\360\277?\375\373YE\221\317\362\277\370\025\206U5\257\333\277\272\274\267\222@\255\357\277\005\304[j\332\337\323?\237\373\205vo\270\377?P1\360\nC)\370\277\250\002\265\374\270!\271\277 \205\215\206\253\324\363?\361>\033\313\342\226\317\277\005\304[j\332\337\323?\313G\251\254k=\257\277\237\373\205vo\270\377?r\253\272\346S&\356?\005\304[j\332\337\323?"
      }
    }
  }
}
node {
  name: "normalize_element/component_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 79
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 79
          }
        }
        tensor_content: "6TY\331N\216\370?\262\252\027b\277\234\352\2776TY\331N\216\370?6TY\331N\216\370?6TY\331N\216\370?6TY\331N\216\370?6TY\331N\216\370?\262\252\027b\277\234\352\2776TY\331N\216\370?\262\252\027b\277\234\352\2776TY\331N\216\370?6TY\331N\216\370?\271\375\232P\336\177\326?6TY\331N\216\370?6TY\331N\216\370?\262\252\027b\277\234\352\277\271\375\232P\336\177\326?\271\375\232P\336\177\326?\262\252\027b\277\234\352\277\262\252\027b\277\234\352\277\262\252\027b\277\234\352\277\262\252\027b\277\234\352\277\262\252\027b\277\234\352\277\262\252\027b\277\234\352\2776TY\331N\216\370?\271\375\232P\336\177\326?\262\252\027b\277\234\352\277\271\375\232P\336\177\326?\262\252\027b\277\234\352\277\262\252\027b\277\234\352\2776TY\331N\216\370?\262\252\027b\277\234\352\277\262\252\027b\277\234\352\2776TY\331N\216\370?\271\375\232P\336\177\326?\262\252\027b\277\234\352\277\271\375\232P\336\177\326?\271\375\232P\336\177\326?6TY\331N\216\370?6TY\331N\216\370?\262\252\027b\277\234\352\2776TY\331N\216\370?\262\252\027b\277\234\352\277\271\375\232P\336\177\326?\262\252\027b\277\234\352\2776TY\331N\216\370?\271\375\232P\336\177\326?\262\252\027b\277\234\352\277\262\252\027b\277\234\352\277\262\252\027b\277\234\352\277\262\252\027b\277\234\352\277\262\252\027b\277\234\352\277\271\375\232P\336\177\326?6TY\331N\216\370?6TY\331N\216\370?\271\375\232P\336\177\326?6TY\331N\216\370?6TY\331N\216\370?\271\375\232P\336\177\326?\271\375\232P\336\177\326?\262\252\027b\277\234\352\277\262\252\027b\277\234\352\277\262\252\027b\277\234\352\277\271\375\232P\336\177\326?\262\252\027b\277\234\352\277\275\037\245S\213\305\366\2776TY\331N\216\370?6TY\331N\216\370?\262\252\027b\277\234\352\277\262\252\027b\277\234\352\277\262\252\027b\277\234\352\277\271\375\232P\336\177\326?6TY\331N\216\370?\262\252\027b\277\234\352\277\262\252\027b\277\234\352\277\271\375\232P\336\177\326?\271\375\232P\336\177\326?\271\375\232P\336\177\326?\262\252\027b\277\234\352\277"
      }
    }
  }
}
node {
  name: "normalize_element/component_2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 79
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 79
          }
        }
        tensor_content: "]\334\220\351\016\264\000@^b\033x\010\031\355\277]\334\220\351\016\264\000@\310\224\377Yp\023\373?\314o\340\313\215\377\002@\016G\301\320t\345\361?\242\210h4\272m\364?j\317\344.h\002\330\277\010\033\273\001\004\372\004@,z\246\313\377\307\354\277\214\213\345\177\n\260\362?\016G\301\320t\345\361?\277OpW\247\013\274?W\356!\246e\336\003@\016G\301\320t\345\361?\302\303\360\000\'\371\336\277.P,\232\003\243\332?\327c\303\231&U\343?\233\257\266\t\217\252\350\277p\275Sr\021\330\324\277,z\246\313\377\307\354\277eP\212\273\261\356\351\277\224\301G\306\345\324\353\277\321\016\343Wlf\347\277\310\224\377Yp\023\373?\327c\303\231&U\343?\247\007\303\247p\201\362\277\317m\261\204\233\326\326?_\"\313F\270r\360\277\216\323\330\202<\377\356\277\024U\330,F\016\005@^b\033x\010\031\355\277\324\205\232\371@\321\345\277]\334\220\351\016\264\000@l\245j\375k\335\345?2h\025\017\251\235\351\277\327c\303\231&U\343?p\275Sr\021\330\324\277\024U\330,F\016\005@\242\210h4\272m\364?\302\303\360\000\'\371\336\277@/6}}6\362?^b\033x\010\031\355\277g\361\273\216\202~\312\277o\265\260\240//\345\277\242\210h4\272m\364?\010\017Ay\032\262\306\277\221J\220$\021j\355\277p\275Sr\021\330\324\277h\307A]\206Y\350\277\363\243\302\333M\241\357\277\216\323\330\202<\377\356\277\277OpW\247\013\274?\r\003@\031T\267\376?]\334\220\351\016\264\000@.P,\232\003\243\332?\276/\331t\362\322\377?\313\013\267\373D~\371?.P,\232\003\243\332?g\361\273\216\202~\312\277\336\352\300\336\276\021\341\277^b\033x\010\031\355\277\020\3235\213\307b\341\277\327c\303\231&U\343?j\317\344.h\002\330\277\332\3577Ty\322\362\277\242\210h4\272m\364?\313\013\267\373D~\371?j\317\344.h\002\330\277\300{\375\375\364\251\362\277\336\352\300\336\276\021\341\277\317m\261\204\233\326\326?\321uTV}\177\346?\324\205\232\371@\321\345\277,z\246\313\377\307\354\277+\016\311\363a\203\271?\327c\303\231&U\343?\277OpW\247\013\274?B7\331N_\337\361\277"
      }
    }
  }
}
node {
  name: "normalize_element/component_3"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 79
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 79
          }
        }
        tensor_content: "o\323\235\025\307j\364?#\347\2458\"\005\331\277\024\321\202;\375\317\002@o\323\235\025\307j\364?Y\377\331^\202\210\004@_(\334\350\261^\357?o\323\235\025\307j\364?\230\212\367\361\027\224\325\277\231\276\t\200\360C\t@\250\254\257\251\245d\343\277%\330\323\311Z\240\347?\002A(8\030\304\346?\364q\253\242\261.\336\277\255A\363I\2350\010@\301\337C=z\035\360?\257CT\177,v\334\277\364\255\220\200\324\356\260?\356\332\006\315*\035\345\277\250\254\257\251\245d\343\277\364\255\220\200\324\356\260?J\302\272}\304\267\355\277\230\212\367\361\027\224\325\277@\347\254\364\335\317\340\277wF\207\202\374\362\311\277\313\272Q\306`\005\375?}\357>B\222{\261\277\'+\017\354\201\333\354\277}\357>B\222{\261\277\005\224cZ?\377\353\277\260\275\213\205\354L\362\277\205; \266CW\n@\356\332\006\315*\035\345\277y7\265\0235\216\350\277\242\264~2\007,\377?\263%\260\241\235\254\311?\003\2435\311\006d\315\277\364\255\220\200\324\356\260?\234lS\024\211\312\302?\205; \266CW\n@o\323\235\025\307j\364?#\347\2458\"\005\331\277o\323\235\025\307j\364?\356\332\006\315*\035\345\277\222\341?2\202\013\336?#\347\2458\"\005\331\277o\323\235\025\307j\364?a\215*\365\347\020\303\277\'+\017\354\201\333\354\277\364\255\220\200\324\356\260?#\347\2458\"\005\331\277\342\374\267\310\374\"\353\277mYf\017\007\224\356\277\364q\253\242\261.\336\277=\327U\317V\251\000@o\323\235\025\307j\364?\263%\260\241\235\254\311?\024\321\202;\375\317\002@\230\331p\251 D\362?6\372\213\201\350p\325?k\006+\355\337X\351?:\240\002\3066\347\337\277<\032:\314\366\275\365\277wF\207\202\374\362\311\277#\347\2458\"\005\331\277#\347\2458\"\005\331\277}\357>B\222{\261\277o\323\235\025\307j\364?\230\331p\251 D\362?\230\212\367\361\027\224\325\277\331\303^\031F&\360\277:\240\002\3066\347\337\277}\357>B\222{\261\277\263%\260\241\235\254\311?a\215*\365\347\020\303\277J\302\272}\304\267\355\277a\215*\365\347\020\303\277\277e\0147\272F\352\277\364q\253\242\261.\336\277<\032:\314\366\275\365\277"
      }
    }
  }
}
node {
  name: "normalize_element/component_4"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 79
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
            size: 79
          }
        }
        tensor_content: "I\000\000\000\000\000\000\000I\000\000\000\000\000\000\000M\000\000\000\000\000\000\000O\000\000\000\000\000\000\000F\000\000\000\000\000\000\000N\000\000\000\000\000\000\000I\000\000\000\000\000\000\000R\000\000\000\000\000\000\000F\000\000\000\000\000\000\000O\000\000\000\000\000\000\000F\000\000\000\000\000\000\000O\000\000\000\000\000\000\000N\000\000\000\000\000\000\000I\000\000\000\000\000\000\000J\000\000\000\000\000\000\000R\000\000\000\000\000\000\000N\000\000\000\000\000\000\000L\000\000\000\000\000\000\000M\000\000\000\000\000\000\000N\000\000\000\000\000\000\000M\000\000\000\000\000\000\000F\000\000\000\000\000\000\000L\000\000\000\000\000\000\000K\000\000\000\000\000\000\000I\000\000\000\000\000\000\000G\000\000\000\000\000\000\000G\000\000\000\000\000\000\000M\000\000\000\000\000\000\000N\000\000\000\000\000\000\000N\000\000\000\000\000\000\000F\000\000\000\000\000\000\000J\000\000\000\000\000\000\000Q\000\000\000\000\000\000\000G\000\000\000\000\000\000\000K\000\000\000\000\000\000\000I\000\000\000\000\000\000\000K\000\000\000\000\000\000\000L\000\000\000\000\000\000\000F\000\000\000\000\000\000\000J\000\000\000\000\000\000\000O\000\000\000\000\000\000\000I\000\000\000\000\000\000\000M\000\000\000\000\000\000\000L\000\000\000\000\000\000\000P\000\000\000\000\000\000\000L\000\000\000\000\000\000\000K\000\000\000\000\000\000\000H\000\000\000\000\000\000\000P\000\000\000\000\000\000\000R\000\000\000\000\000\000\000O\000\000\000\000\000\000\000P\000\000\000\000\000\000\000F\000\000\000\000\000\000\000G\000\000\000\000\000\000\000I\000\000\000\000\000\000\000K\000\000\000\000\000\000\000F\000\000\000\000\000\000\000K\000\000\000\000\000\000\000O\000\000\000\000\000\000\000P\000\000\000\000\000\000\000R\000\000\000\000\000\000\000R\000\000\000\000\000\000\000N\000\000\000\000\000\000\000G\000\000\000\000\000\000\000M\000\000\000\000\000\000\000P\000\000\000\000\000\000\000I\000\000\000\000\000\000\000I\000\000\000\000\000\000\000P\000\000\000\000\000\000\000J\000\000\000\000\000\000\000R\000\000\000\000\000\000\000L\000\000\000\000\000\000\000M\000\000\000\000\000\000\000J\000\000\000\000\000\000\000N\000\000\000\000\000\000\000F\000\000\000\000\000\000\000K\000\000\000\000\000\000\000O\000\000\000\000\000\000\000J\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "normalize_element/component_5"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 79
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
            size: 79
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\003\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\003\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\003\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\003\000\000\000\000\000\000\000\003\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\003\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\003\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\003\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\003\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\003\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\003\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\003\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\003\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\003\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\003\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "normalize_element/component_6"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 79
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 79
          }
        }
        tensor_content: "3f\335@\007\251\003@\224>\216\355\300N\351\2778}\353\276ix\372?\205bO\257\270\033\363?\336/!\350\274\306\372?\252\217\362\350\2616\324?\033\255\370\366\222\373\357?\004]j\272\214\257\206?\004\321\234y`\006\373?\203\277L`D\235\363\277\305<\260\030\275\212\345?\346\243\033kv\376\355?\245\204<tv\306\303?\207\277u_\276\'\001@\307\366\001e\255\363\366?\366-!\025\004\017\307\277\275\353\357\031\264\314\340?\357\027F\301\0248\350?\234\217N\354\311\014\356\277\206aY4S\361\315\277\001tx\261\340 \361\277\235\262\270C_\210\343\277\017\0263Z\241@\354\277\203V\231\347M\337\322\277S\323%\337{a\000@\2721s\346\303\262\335?zK\"\n\246c\371\277w\372\275\341Z\\\352?\336\214\024\301~\246\360\277\212\263~\030:\320\365\277\322\031\352\275\0179\306?\241Ia\241&\201\350\277\217aq\207\230b\327\2777\375\3554\334 \375?\2163\335dj/\356?}\005oj\261{\345\277h\022\21709I\362?\210J%\007mD\212\277\303\031{\200\361a\374?\017\177\346\322\227\376\374?h&\221\"\030\013\257\277]\344\027z\217\367\353?\007\242\003\030\036\266\354\277\253\246<\372H\320\360?s\327\"\233\007\333\340\277\323\001\245E.$\357?C\013\336 \372y\252?\\X*}\350\277\354\277\272\260\024Gd\207\305\277@B\356\223\260\000\327\277\334/\213fPl\363\277D\345\2667v\333\364\277S\301\365u~\016\333\277\272\353\306\032:B\003@7\375\3554\334 \375?:g\370\352\332\020\276?\241U\201\347$c\361??q\035w_\253\374?#\212\013\205\361E\327?\205<-\262\031\316\242\277xn\313\370\316\323\345\277\342]\026\315\215\001\357\277}(\336\255+H\340\277\334\273H\220\022\242\333?$\240_\033#\265\316\277\354\321;7G\352\343\277\251&D\\\240\311\370?\004\364\013\275\332\322\365?\032!p\214\232\030\324\277\225\341\305\373\376\037\365\277I\331\"\233\032\262\350\2772rj\t\370Z\326?`\036bd(g\365?\027\255\314\363\271F\341\277\234\217N\354\311\014\356\277#\303\316^\235\201\311\277\362\364\314\245\320\311\342?\007kb\017\340%\256?\206yi\355j\263\370\277"
      }
    }
  }
}
node {
  name: "normalize_element/component_7"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 79
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 79
          }
        }
        tensor_content: "\000\000\000\000\000\000&@\000\000\000\000\000\0004@\000\000\000\000\000\000/@\000\000\000\000\000\2002@\000\000\000\000\000\000.@\232\231\231\231\231\0312@\000\000\000\000\000\000.@\000\000\000\000\000\000;@\000\000\000\000\000\000,@\232\231\231\231\231\331A@\000\000\000\000\000\0002@\232\231\231\231\231\2311@\315\314\314\314\314\3144@\000\000\000\000\000\000*@\000\000\000\000\000\0000@\000\000\000\000\000\000;@\232\231\231\231\231\2314@\000\000\000\000\000\0002@\000\000\000\000\000\000>@3333337@\000\000\000\000\000\200?@\000\000\000\000\000\0008@\000\000\000\000\000\000;@\000\000\000\000\000\0007@\000\000\000\000\000\000*@\000\000\000\000\000\0001@\000\000\000\000\000\200A@\000\000\000\000\000\0003@33333\263C@\315\314\314\314\314\014B@\000\000\000\000\000\000,@\000\000\000\000\000\000:@\232\231\231\231\231\231?@\000\000\000\000\000\000,@\000\000\000\000\000\000.@\000\000\000\000\000\0006@\000\000\000\000\000\0000@\000\000\000\000\000\0003@\000\000\000\000\000\000,@\000\000\000\000\000\000,@\315\314\314\314\314L6@\000\000\000\000\000\000,@\000\000\000\000\000\200>@\000\000\000\000\000\2000@\000\000\000\000\000\200A@\000\000\000\000\000\000*@\000\000\000\000\000\0002@\000\000\000\000\000\000:@fffff\346;@\000\000\000\000\000\000;@fffff\346?@\315\314\314\314\314LF@\000\000\000\000\000\0005@\000\000\000\000\000\000(@\000\000\000\000\000\000*@\000\000\000\000\000\0005@\000\000\000\000\000\000.@\000\000\000\000\000\000.@\000\000\000\000\000\2005@\232\231\231\231\231Y@@\000\000\000\000\000\000B@\000\000\000\000\000\000F@\232\231\231\231\231\0315@\000\000\000\000\000\0003@\000\000\000\000\000\2008@33333\2637@\000\000\000\000\000\000,@\000\000\000\000\000\000.@\000\000\000\000\000\000<@\000\000\000\000\000\000@@\000\000\000\000\000\000@@\000\000\000\000\000\0006@\000\000\000\000\000\0001@\000\000\000\000\000\0008@\000\000\000\000\000\000>@\000\000\000\000\000\0002@\000\000\000\000\000\000.@\315\314\314\314\314\3143@\000\000\000\000\000\000?@"
      }
    }
  }
}
node {
  name: "TensorSliceDataset"
  op: "TensorSliceDataset"
  input: "normalize_element/component_0"
  input: "normalize_element/component_1"
  input: "normalize_element/component_2"
  input: "normalize_element/component_3"
  input: "normalize_element/component_4"
  input: "normalize_element/component_5"
  input: "normalize_element/component_6"
  input: "normalize_element/component_7"
  device: "/device:CPU:0"
  attr {
    key: "Toutput_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_INT64
        type: DT_INT64
        type: DT_DOUBLE
        type: DT_DOUBLE
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "buffer_size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 1000
      }
    }
  }
}
node {
  name: "seed"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "seed2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "ShuffleDataset"
  op: "ShuffleDataset"
  input: "TensorSliceDataset"
  input: "buffer_size"
  input: "seed"
  input: "seed2"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_INT64
        type: DT_INT64
        type: DT_DOUBLE
        type: DT_DOUBLE
      }
    }
  }
  attr {
    key: "reshuffle_each_iteration"
    value {
      b: true
    }
  }
}
node {
  name: "count"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: -1
      }
    }
  }
}
node {
  name: "RepeatDataset"
  op: "RepeatDataset"
  input: "ShuffleDataset"
  input: "count"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_INT64
        type: DT_INT64
        type: DT_DOUBLE
        type: DT_DOUBLE
      }
    }
  }
}
node {
  name: "batch_size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 8
      }
    }
  }
}
node {
  name: "drop_remainder"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_BOOL
        tensor_shape {
        }
        bool_val: false
      }
    }
  }
}
node {
  name: "BatchDatasetV2"
  op: "BatchDatasetV2"
  input: "RepeatDataset"
  input: "batch_size"
  input: "drop_remainder"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_INT64
        type: DT_INT64
        type: DT_DOUBLE
        type: DT_DOUBLE
      }
    }
  }
  attr {
    key: "parallel_copy"
    value {
      b: false
    }
  }
}
node {
  name: "ModelDataset"
  op: "ModelDataset"
  input: "BatchDatasetV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "algorithm"
    value {
      i: 0
    }
  }
  attr {
    key: "cpu_budget"
    value {
      i: 0
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_INT64
        type: DT_INT64
        type: DT_DOUBLE
        type: DT_DOUBLE
      }
    }
  }
  attr {
    key: "ram_budget"
    value {
      i: 0
    }
  }
}
node {
  name: "optimizations_enabled"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "optimizations_disabled"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "optimizations_default"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 3
          }
        }
        string_val: "shuffle_and_repeat_fusion"
        string_val: "map_and_batch_fusion"
        string_val: "noop_elimination"
      }
    }
  }
}
node {
  name: "OptimizeDatasetV2"
  op: "OptimizeDatasetV2"
  input: "ModelDataset"
  input: "optimizations_enabled"
  input: "optimizations_disabled"
  input: "optimizations_default"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "optimization_configs"
    value {
      list {
        s: "autotune_buffer_sizes:autotune:true"
        s: "disable_prefetch_legacy_autotune:autotune:true"
        s: "enable_gradient_descent:autotune:true"
        s: "map_parallelization:autotune:true"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_INT64
        type: DT_INT64
        type: DT_DOUBLE
        type: DT_DOUBLE
      }
    }
  }
}
node {
  name: "IteratorV2"
  op: "IteratorV2"
  device: "/device:CPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@BatchDatasetV2"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_INT64
        type: DT_INT64
        type: DT_DOUBLE
        type: DT_DOUBLE
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MakeIterator"
  op: "MakeIterator"
  input: "OptimizeDatasetV2"
  input: "IteratorV2"
  device: "/device:CPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@BatchDatasetV2"
      }
    }
  }
}
node {
  name: "IteratorToStringHandle"
  op: "IteratorToStringHandle"
  input: "IteratorV2"
  device: "/device:CPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@BatchDatasetV2"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "IteratorGetNext"
  op: "IteratorGetNext"
  input: "IteratorV2"
  device: "/device:CPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@BatchDatasetV2"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_INT64
        type: DT_INT64
        type: DT_DOUBLE
        type: DT_DOUBLE
      }
    }
  }
}
node {
  name: "dnn/Cast"
  op: "Cast"
  input: "IteratorGetNext"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/Cast_1"
  op: "Cast"
  input: "IteratorGetNext:1"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/Cast_2"
  op: "Cast"
  input: "IteratorGetNext:2"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/Cast_3"
  op: "Cast"
  input: "IteratorGetNext:3"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/Cast_4"
  op: "Cast"
  input: "IteratorGetNext:6"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Acceleration_1/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Acceleration_1/ExpandDims"
  op: "ExpandDims"
  input: "dnn/Cast"
  input: "dnn/input_from_feature_columns/input_layer/Acceleration_1/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Acceleration_1/Shape"
  op: "Shape"
  input: "dnn/input_from_feature_columns/input_layer/Acceleration_1/ExpandDims"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Acceleration_1/strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Acceleration_1/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Acceleration_1/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Acceleration_1/strided_slice"
  op: "StridedSlice"
  input: "dnn/input_from_feature_columns/input_layer/Acceleration_1/Shape"
  input: "dnn/input_from_feature_columns/input_layer/Acceleration_1/strided_slice/stack"
  input: "dnn/input_from_feature_columns/input_layer/Acceleration_1/strided_slice/stack_1"
  input: "dnn/input_from_feature_columns/input_layer/Acceleration_1/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Acceleration_1/Reshape/shape/1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Acceleration_1/Reshape/shape"
  op: "Pack"
  input: "dnn/input_from_feature_columns/input_layer/Acceleration_1/strided_slice"
  input: "dnn/input_from_feature_columns/input_layer/Acceleration_1/Reshape/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Acceleration_1/Reshape"
  op: "Reshape"
  input: "dnn/input_from_feature_columns/input_layer/Acceleration_1/ExpandDims"
  input: "dnn/input_from_feature_columns/input_layer/Acceleration_1/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Cylinders_1/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Cylinders_1/ExpandDims"
  op: "ExpandDims"
  input: "dnn/Cast_1"
  input: "dnn/input_from_feature_columns/input_layer/Cylinders_1/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Cylinders_1/Shape"
  op: "Shape"
  input: "dnn/input_from_feature_columns/input_layer/Cylinders_1/ExpandDims"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Cylinders_1/strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Cylinders_1/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Cylinders_1/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Cylinders_1/strided_slice"
  op: "StridedSlice"
  input: "dnn/input_from_feature_columns/input_layer/Cylinders_1/Shape"
  input: "dnn/input_from_feature_columns/input_layer/Cylinders_1/strided_slice/stack"
  input: "dnn/input_from_feature_columns/input_layer/Cylinders_1/strided_slice/stack_1"
